Repository: TechUnRestricted/PSDirectSender
Catalog: PSDirectSender/*.lproj/Localizable.strings
Languages: ru

source: 192.168.1.100 (example)
ru: 192.168.1.100 (пример)

source: 12800 (default)
ru: 12800 (по умолчанию)

source: Add
ru: Добавить

source: Apply Settings and Restart Server
ru: Применить настройки и перезапустить сервер

source: Cancel
ru: Отменить

source: Check Server status
ru: Проверить статус сервера

source: Clear logs
ru: Очистить

source: Configuration
ru: Конфигурация

source: Console connection configuration data is missing. Go to the Configuration section and correctly fill in the text fields.
ru: Отсутствуют данные конфигурации для подключения к консоли. Перейдите в раздел Конфигурация и заполните текстовые поля корректными данными.

source: Copy logs
ru: Скопировать

source: Delete
ru: Удалить

source: for Remote Package Installer
ru: для Remote Package Installer

source: Got it!
ru: Понятно

source: Important message
ru: Важное сообщение

source: Info
ru: Информация

source: IP Address
ru: IP Адрес

source: Logs
ru: Логи

source: Navigation
ru: Навигация

source: Network connection was not detected. If there is a connection, then specify the IP address of your network card and any port in the Configuration section.
ru: Подключение к сети не было обнаружено. Если же подключение к сети имеется, перейдите в раздел Конфигурация, введите вручную IP адрес вашей сетевой карты и любой порт.

source: No response received from Remote Package Installer. Make sure the data you entered in the Configuration section is correct and the Remote Package Installer application is active. As a last resort, restart your console and try sending again.
ru: Не получен ответ от Remote Package Installer. Убедитесь, что данные, которые Вы ввели в раздел Конфигурация, являются корректными, и приложение Remote Package Installer запущено на Вашей консоли. В крайнем случае, попробуйте перезапустить консоль и повторить отправку повторно.

source: Port
ru: Порт

source: Queue
ru: Очередь

source: Remote Package Installer Configuration
ru: Конфигурация Remote Package Installer

source: RPI Port
ru: Порт RPI

source: Send
ru: Отправить

source: Sending packages...
ru: Отправка пакетов...

source: Server Configuration
ru: Конфигурация сервера

source: This field is usually filled in automatically by the program. If this field was not filled in automatically, make sure that your computer is connected to the local network. You can specify any value between 0 and 65536, however, some ports may be busy/reserved for other applications.
ru: Данное поле обычно заполняется приложением автоматически. Если данное поле не было заполнено автоматически, убедитесь, что Ваш компьютер подключен к локальной сети. Вы можете указать любое значение в диапазоне от 0 до 65536. Однако, некоторые порты могут быть заняты/зарезервированы для других приложений.

source: This field is usually filled in automatically by the program. It specifies the IP address of one of your network cards (Wi-Fi, Ethernet) on your Mac. If this field was not filled in automatically, make sure that your computer is connected to the local network. You can select the IP address of one of your network cards by clicking on the down arrow in the text field. The IP address can also be found by going to [System Preferences -> Network -> (Device) -> IP Address]
ru: Данное поле обычно заполняется приложением автоматически. В данное поле вводится IP адрес одной из ваших сетевых карт (Wi-FI, Ethernet) компьютера Mac. Если данное поле не было заполнено автоматически, убедитесь, что Ваш компьютер подключен к локальной сети. Вы можете выбрать нужный IP адрес из списка, нажав на стрелку вниз на данном текстовом поле. Также IP адрес можно узнать перейдя в [Настройки системы -> Сеть -> (Устройство) -> IP Адрес]

source: This field must be filled in manually. On your console go to the [Settings -> Network -> View Connection Status]. Find the IP Address entry and enter it into this field.
ru: Данное поле должно быть заполнено вручную. На Вашей консоли перейдите в раздел [Настройки -> Сеть -> Посмотреть статус сетевого подключения]. Найдите пункт IP Адрес и введите в данное поле.

source: This software contains a third-party library "Mongoose - Embedded Web Server" which is distributed under the GNU General Public License, Version 2.0
ru: Данное программное обеспечение содержит стороннюю библиотеку "Mongoose - Embedded Web Server" распространяемую под лицензией GNU General Public License, Version 2.0

source: This software is distributed under the Apache License, Version 2.0.
ru: Данное программное обеспечение распространяется под лицензией Apache License, Version 2.0.

source: This value set by default and should not be changed without special reason. Points to the port used by the Remote Package Installer application on your console.
ru: Данное значение установлено по умолчанию и не требует изменения без особой причины. Оно обозначает порт, использующийся приложением Remote Package Installer на Вашей консоли.

source: Version: %@
ru: Версия: %@

source: View Open Source Licenses
ru: Посмотреть лицензии программного обеспечения с открытым исходным кодом

source: View Source Code on GitHub
ru: Посмотреть исходный код на GitHub

source: Success
ru: Запущен

source: Failed
ru: Ошибка

source: Stopped
ru: Остановлен

source: Invalid configuration data
ru: Неверные данные конфигурации

source: Drop .pkg files
ru: Перетащите файлы .pkg
